src/Catalogs/Scan_СтатусыЗаявокНаДействие/Scan_СтатусыЗаявокНаДействие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_СтатусыЗаявокНаДействие</name>
  <predefined>
    <items>
      <name>Аннулирована</name>
      <description>Аннулирована</description>
    </items>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>ДоставкаЗавершена</name>
      <description>Доставка завершена</description>
    </items>
    <items>
      <name>ЗаявкаОтправлена</name>
      <description>Заявка отправлена</description>
    </items>
    <items>
      <name>Исполнена</name>
      <description>Исполнена</description>
    </items>
    <items>
      <name>Новая</name>
      <description>Новая</description>
    </items>
    <items>
      <name>Отклонена</name>
      <description>Отклонена</description>
    </items>
    <items>
      <name>Подтверждена</name>
      <description>Подтверждена</description>
    </items>
  </predefined>
  <attributes>
    <name>НедоступноДляВыбора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <comment>Порядок сортировки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <comment>Цвет заказ-наряда в журналах</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекста</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Шрифт</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Scan_СтатусыЗаявокНаДействие/Forms/ФормаЭлемента/Module.bsl
//rarus sergei 28.06.2016 mantis 6976 ++
// Модуль формы элемента справочника "Scan_СтатусыЗаявокНаДействие"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ПолучитьПорядокЭлемента()
	
	//присвоим порядку номер последний + 1
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(Scan_СтатусыЗаявокНаДействие.РеквизитДопУпорядочивания) КАК Порядок
	               |ИЗ
	               |	Справочник.Scan_СтатусыЗаявокНаДействие КАК Scan_СтатусыЗаявокНаДействие";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Порядок + 1;
	КонецЕсли;
	
	Возврат 1;
	
КонецФункции

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.РеквизитДопУпорядочивания = ПолучитьПорядокЭлемента();
	Scan_СборСтатистики.Scan_ПриОткрытии("Справочники", РеквизитФормыВЗначение("Объект").Метаданные().Синоним);	

	// Дальнейшие операции выпольняются только для новых объектов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбъектТекущий = РеквизитФормыВЗначение("Объект");
		Цвет = ОбъектТекущий.Цвет.Получить();
		//rarus tenkam 30.12.2016 mantis 8223 ++
		Шрифт = ОбъектТекущий.Шрифт.Получить();	
		ЦветТекста = ОбъектТекущий.ЦветТекста.Получить();	
		//rarus tenkam 30.12.2016 mantis 8223 --
		Возврат;
	КонецЕсли;
	
	// Обновляем отображение элементов формы
	ОбъектТекущий = РеквизитФормыВЗначение("Объект");
	//задаем начальный цвет статусу
	Цвет=Новый Цвет(255,255,255);
	ОбъектТекущий.Цвет = Новый ХранилищеЗначения(Цвет);

	//rarus tenkam 30.12.2016 mantis 8223 ++
	Шрифт = Новый Шрифт("Авто", 8);
	ОбъектТекущий.Шрифт = Новый ХранилищеЗначения(Шрифт);
	ЦветТекста = Новый Цвет(51,51,51);
	ОбъектТекущий.ЦветТекста = Новый ХранилищеЗначения(ЦветТекста);
	//rarus tenkam 30.12.2016 mantis 8223 --
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	//сохраняем цвет статуса
	ОбъектТекущий = РеквизитФормыВЗначение("Объект");
	ОбъектТекущий.Цвет=Новый ХранилищеЗначения(Цвет);
	//rarus tenkam 30.12.2016 mantis 8223 ++
	ОбъектТекущий.Шрифт = Новый ХранилищеЗначения(Шрифт);
	ОбъектТекущий.ЦветТекста = Новый ХранилищеЗначения(ЦветТекста);
	//rarus tenkam 30.12.2016 mantis 8223 --
	ОбъектТекущий.ОбменДанными.Загрузка=Истина;
	Попытка
		ОбъектТекущий.Записать();
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) // Rarus tenkam 11.04.2022 mantis 18433 +++

	Если Объект.Ссылка.Пустая() Тогда
		Scan_СборСтатистики.Scan_ПередЗаписьюСправочника(РеквизитФормыВЗначение("Объект").Метаданные().Синоним, Истина, "Создание нового элемента");
	КонецЕсли;
КонецПроцедуры 	// Rarus tenkam 11.04.2022 mantis 18433 ---

//rarus sergei 28.06.2016 mantis 6976 --
